Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_rcc.h
/** @addtogroup LSE_configuration
 * @{
 */

#define RCC_LSE_DISABLE ((uint32_t)0x00000000)
#define RCC_LSE_ENABLE  ((uint32_t)0x00000004)
#define RCC_LSE_BYPASS  ((uint32_t)0x00000010)
#define IS_RCC_LSE(LSE) (((LSE) == RCC_LSE_DISABLE) || ((LSE) == RCC_LSE_ENABLE) || ((LSE) == RCC_LSE_BYPASS))
/**
 * @}
 */

/** @addtogroup RTC_clock_source
 * @{
 */

#define RCC_RTCCLK_SRC_NONE       ((uint32_t)0x00000000)
#define RCC_RTCCLK_SRC_LSE        ((uint32_t)0x00000020)
#define RCC_RTCCLK_SRC_LSI        ((uint32_t)0x00000040)
#define RCC_RTCCLK_SRC_HSE_DIV128 ((uint32_t)0x00000060)
#define IS_RCC_RTCCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_RTCCLK_SRC_NONE) || ((SOURCE) == RCC_RTCCLK_SRC_LSE) || ((SOURCE) == RCC_RTCCLK_SRC_LSI)         \
  || ((SOURCE) == RCC_RTCCLK_SRC_HSE_DIV128))
/**
 * @}
 */

/** @addtogroup LPRUN_clock_source
 * @{
 */

#define RCC_LPRUNCLK_SRC_LSI        ((uint32_t)0x00000000)
#define RCC_LPRUNCLK_SRC_LSE        ((uint32_t)0x00000200)
#define IS_RCC_LPRUNCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_LPRUNCLK_SRC_LSI) || ((SOURCE) == RCC_LPRUNCLK_SRC_LSE))
/**
 * @}
 */

/** @addtogroup TSC_clock_source
 * @{
 */

#define RCC_TSCCLK_SRC_LSI        ((uint32_t)0x00000000)
#define RCC_TSCCLK_SRC_LSE        ((uint32_t)0x00000400)
#define IS_RCC_TSCCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_TSCCLK_SRC_LSI) || ((SOURCE) == RCC_TSCCLK_SRC_LSE))
/**
 * @}
 */

/** @addtogroup AHB_peripheral
 * @{
 */

#define RCC_AHB_PERIPH_DMA    ((uint32_t)0x00000001)
#define RCC_AHB_PERIPH_SRAM   ((uint32_t)0x00000004)
#define RCC_AHB_PERIPH_FLITF  ((uint32_t)0x00000010)
#define RCC_AHB_PERIPH_HSQRT  ((uint32_t)0x00000020)
#define RCC_AHB_PERIPH_CRC    ((uint32_t)0x00000040)
#define RCC_AHB_PERIPH_HDIV   ((uint32_t)0x00000080)
#define RCC_AHB_PERIPH_RNGC   ((uint32_t)0x00000200)
#define RCC_AHB_PERIPH_SAC    ((uint32_t)0x00000800)
#define RCC_AHB_PERIPH_ADC    ((uint32_t)0x00001000)

#define IS_RCC_AHB_PERIPH(PERIPH) ((((PERIPH)&0xFFFFE50A) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_AHB_PERIPH_RESET(PERIPH) ((((PERIPH)&0xFFFFE55F) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */

/** @addtogroup APB2_peripheral
 * @{
 */

#define RCC_APB2_PERIPH_AFIO   ((uint32_t)0x00000001)
#define RCC_APB2_PERIPH_GPIOA  ((uint32_t)0x00000004)
#define RCC_APB2_PERIPH_GPIOB  ((uint32_t)0x00000008)
#define RCC_APB2_PERIPH_GPIOC  ((uint32_t)0x00000010)
#define RCC_APB2_PERIPH_GPIOD  ((uint32_t)0x00000020)
#define RCC_APB2_PERIPH_GPIOF  ((uint32_t)0x00000080)
#define RCC_APB2_PERIPH_SPI1   ((uint32_t)0x00000200)
#define RCC_APB2_PERIPH_SPI2   ((uint32_t)0x00000400)
#define RCC_APB2_PERIPH_SPI3   ((uint32_t)0x00000800)
#define RCC_APB2_PERIPH_TIM1   ((uint32_t)0x00001000)
#define RCC_APB2_PERIPH_TIM8   ((uint32_t)0x00002000)
#define RCC_APB2_PERIPH_USART1 ((uint32_t)0x00004000)
#define RCC_APB2_PERIPH_UART6  ((uint32_t)0x00020000)

#define IS_RCC_APB2_PERIPH(PERIPH) ((((PERIPH)&0xFFFD8142) == 0x00) && ((PERIPH) != 0x00))
/**
 * @}
 */

/** @addtogroup APB1_peripheral
 * @{
 */

#define RCC_APB1_PERIPH_TIM3      ((uint32_t)0x00000002)
#define RCC_APB1_PERIPH_TIM4      ((uint32_t)0x00000004)
#define RCC_APB1_PERIPH_LPTIM     ((uint32_t)0x00000008)
#define RCC_APB1_PERIPH_TIM6      ((uint32_t)0x00000010)
#define RCC_APB1_PERIPH_BEEP1     ((uint32_t)0x00000020)
#define RCC_APB1_PERIPH_BEEP2     ((uint32_t)0x00000040)
#define RCC_APB1_PERIPH_COMP      ((uint32_t)0x00000100)
#define RCC_APB1_PERIPH_COMPFILT  ((uint32_t)0x00000200)
#define RCC_APB1_PERIPH_TSC       ((uint32_t)0x00000400)
#define RCC_APB1_PERIPH_WWDG      ((uint32_t)0x00000800)
#define RCC_APB1_PERIPH_USART2    ((uint32_t)0x00020000)
#define RCC_APB1_PERIPH_LPUART1   ((uint32_t)0x00040000)
#define RCC_APB1_PERIPH_LPUART2   ((uint32_t)0x00080000)
#define RCC_APB1_PERIPH_UART5     ((uint32_t)0x00100000)
#define RCC_APB1_PERIPH_I2C1      ((uint32_t)0x00200000)
#define RCC_APB1_PERIPH_I2C2      ((uint32_t)0x00400000)
#define RCC_APB1_PERIPH_CAN       ((uint32_t)0x04000000)
#define RCC_APB1_PERIPH_PWR       ((uint32_t)0x10000000)
#define RCC_APB1_PERIPH_OPAMP     ((uint32_t)0x80000000)

#define IS_RCC_APB1_PERIPH(PERIPH) ((((PERIPH)&0x6B81F081) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_APB1_PERIPH_RESET(PERIPH) ((((PERIPH)&0xEB81F381) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */
 
/** @addtogroup LPTIM
 * @{
 */
#define RCC_LPTIMCLK_SRC_MASK  ((uint32_t)0xFF1FFFFF)

#define RCC_LPTIMCLK_SRC_APB1  ((uint32_t)0x00000000)
#define RCC_LPTIMCLK_SRC_HSI   ((uint32_t)0x00200000)
#define RCC_LPTIMCLK_SRC_HSE   ((uint32_t)0x00400000)
#define RCC_LPTIMCLK_SRC_LSI   ((uint32_t)0x00600000)
#define RCC_LPTIMCLK_SRC_LSE   ((uint32_t)0x00800000)
#define RCC_LPTIMCLK_SRC_COMP1 ((uint32_t)0x00A00000)

#define IS_RCC_LPTIM_CLK(LPTIMCLK)                                                            \
        (((LPTIMCLK) == RCC_LPTIMCLK_SRC_APB1) || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_HSI)        \
      || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_HSE)  || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_LSI)        \
      || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_LSE)  || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_COMP1))

/**
 * @}
 */
 
/** @addtogroup LPUART
 * @{
 */

#define RCC_LPUART1CLK            ((uint32_t)0x00000000)
#define RCC_LPUART2CLK            ((uint32_t)0x00000001)
#define IS_RCC_LPUARTX(LPUARTX)   (((LPUARTX) == RCC_LPUART1CLK) || ((LPUARTX) == RCC_LPUART2CLK))
 
#define RCC_LPUART1CLK_SRC_MASK   ((uint32_t)0xF1FFFFFF)
#define RCC_LPUART2CLK_SRC_MASK   ((uint32_t)0x8FFFFFFF)

#define RCC_LPUARTCLK_SRC_APB1    ((uint32_t)0x00000000)
#define RCC_LPUARTCLK_SRC_SYSCLK  ((uint32_t)0x00000001)
#define RCC_LPUARTCLK_SRC_HSI     ((uint32_t)0x00000002)
#define RCC_LPUARTCLK_SRC_HSE     ((uint32_t)0x00000003)
#define RCC_LPUARTCLK_SRC_LSI     ((uint32_t)0x00000004)
#define RCC_LPUARTCLK_SRC_LSE     ((uint32_t)0x00000005)

