Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_rcc.h
#define IS_RCC_LPUART_CLK(LPUARTCLK) (((LPUARTCLK) <= RCC_LPUARTCLK_SRC_LSE))

/**
 * @}
 */
 
#define RCC_MCO_CLK_DIV2  ((uint32_t)0x20000000)
#define RCC_MCO_CLK_DIV3  ((uint32_t)0x30000000)
#define RCC_MCO_CLK_DIV4  ((uint32_t)0x40000000)
#define RCC_MCO_CLK_DIV5  ((uint32_t)0x50000000)
#define RCC_MCO_CLK_DIV6  ((uint32_t)0x60000000)
#define RCC_MCO_CLK_DIV7  ((uint32_t)0x70000000)
#define RCC_MCO_CLK_DIV8  ((uint32_t)0x80000000)
#define RCC_MCO_CLK_DIV9  ((uint32_t)0x90000000)
#define RCC_MCO_CLK_DIV10 ((uint32_t)0xA0000000)
#define RCC_MCO_CLK_DIV11 ((uint32_t)0xB0000000)
#define RCC_MCO_CLK_DIV12 ((uint32_t)0xC0000000)
#define RCC_MCO_CLK_DIV13 ((uint32_t)0xD0000000)
#define RCC_MCO_CLK_DIV14 ((uint32_t)0xE0000000)
#define RCC_MCO_CLK_DIV15 ((uint32_t)0xF0000000)
#define IS_RCC_MCOCLKPRE(DIV)                                                                              \
       (((DIV) == RCC_MCO_CLK_DIV2)  || ((DIV) == RCC_MCO_CLK_DIV3)                                        \
     || ((DIV) == RCC_MCO_CLK_DIV4)  || ((DIV) == RCC_MCO_CLK_DIV5)  || ((DIV) == RCC_MCO_CLK_DIV6)        \
     || ((DIV) == RCC_MCO_CLK_DIV7)  || ((DIV) == RCC_MCO_CLK_DIV8)  || ((DIV) == RCC_MCO_CLK_DIV9)        \
     || ((DIV) == RCC_MCO_CLK_DIV10) || ((DIV) == RCC_MCO_CLK_DIV11) || ((DIV) == RCC_MCO_CLK_DIV12)       \
     || ((DIV) == RCC_MCO_CLK_DIV13) || ((DIV) == RCC_MCO_CLK_DIV14) || ((DIV) == RCC_MCO_CLK_DIV15))

/** @addtogroup Clock_source_to_output_on_MCO_pin
 * @{
 */

#define RCC_MCO_NOCLK       ((uint8_t)0x00)
#define RCC_MCO_LSI         ((uint8_t)0x01)
#define RCC_MCO_LSE         ((uint8_t)0x02)
#define RCC_MCO_SYSCLK      ((uint8_t)0x03)
#define RCC_MCO_HSI         ((uint8_t)0x04)
#define RCC_MCO_HSE         ((uint8_t)0x05)
#define RCC_MCO_PLLCLK_PRES ((uint8_t)0x06)

#define IS_RCC_MCO(MCO)       \
    (((MCO) == RCC_MCO_NOCLK)  || ((MCO) == RCC_MCO_LSI)  || ((MCO) == RCC_MCO_LSE)  || \
		((MCO) == RCC_MCO_SYSCLK) || ((MCO) == RCC_MCO_HSI)                      \
  || ((MCO) == RCC_MCO_HSE)    || ((MCO) == RCC_MCO_PLLCLK_PRES))

/**
 * @}
 */

/** @addtogroup RCC_Flag
 * @{
 */
#define RCC_CTRL_FLAG_HSIRDF        ((uint8_t)0x21)
#define RCC_CTRL_FLAG_HSERDF        ((uint8_t)0x31)
#define RCC_CTRL_FLAG_PLLRDF        ((uint8_t)0x39)
#define RCC_LSCTRL_FLAG_LSIRD       ((uint8_t)0x41)
#define RCC_LSCTRL_FLAG_LSERD       ((uint8_t)0x43)
#define RCC_CTRLSTS_FLAG_RMRSTF     ((uint8_t)0x80)
#define RCC_CTRLSTS_FLAG_RAMRSTF    ((uint8_t)0x81)
#define RCC_CTRLSTS_FLAG_MMURSTF    ((uint8_t)0x82)
#define RCC_CTRLSTS_FLAG_PINRSTF    ((uint8_t)0x83)
#define RCC_CTRLSTS_FLAG_PORRSTF    ((uint8_t)0x84)
#define RCC_CTRLSTS_FLAG_SFTRSTF    ((uint8_t)0x85)
#define RCC_CTRLSTS_FLAG_IWDGRSTF   ((uint8_t)0x86)
#define RCC_CTRLSTS_FLAG_WWDGRSTF   ((uint8_t)0x87)
#define RCC_CTRLSTS_FLAG_LPWRRSTF   ((uint8_t)0x88)
#define RCC_CTRLSTS_FLAG_EMCGBNRSTF ((uint8_t)0x89)
#define RCC_CTRLSTS_FLAG_EMCGBRSTF  ((uint8_t)0x8A)
#define RCC_CTRLSTS_FLAG_EMCCLPRSTF ((uint8_t)0x8B)

#define IS_RCC_FLAG(FLAG)                                                                                                       \
    (((FLAG) == RCC_CTRL_FLAG_HSIRDF)      || ((FLAG) == RCC_CTRL_FLAG_HSERDF)        || ((FLAG) == RCC_CTRL_FLAG_PLLRDF)       \
  || ((FLAG) == RCC_LSCTRL_FLAG_LSIRD)     || ((FLAG) == RCC_LSCTRL_FLAG_LSERD)       || ((FLAG) == RCC_CTRLSTS_FLAG_RAMRSTF)   \
  || ((FLAG) == RCC_CTRLSTS_FLAG_MMURSTF)  || ((FLAG) == RCC_CTRLSTS_FLAG_PINRSTF)    || ((FLAG) == RCC_CTRLSTS_FLAG_PORRSTF)   \
  || ((FLAG) == RCC_CTRLSTS_FLAG_SFTRSTF)  || ((FLAG) == RCC_CTRLSTS_FLAG_IWDGRSTF)   || ((FLAG) == RCC_CTRLSTS_FLAG_WWDGRSTF)  \
  || ((FLAG) == RCC_CTRLSTS_FLAG_LPWRRSTF) || ((FLAG) == RCC_CTRLSTS_FLAG_EMCGBNRSTF) || ((FLAG) == RCC_CTRLSTS_FLAG_EMCGBRSTF) \
  || ((FLAG) == RCC_CTRLSTS_FLAG_EMCCLPRSTF))

#define IS_RCC_CALIB_VALUE(VALUE) ((VALUE) <= 0x1F)
#define IS_RCC_MSICALIB_VALUE(VALUE) ((VALUE) <= 0xFF)
/**
 * @}
 */

/**
 * @}
 */

/** @addtogroup RCC_Exported_Macros
 * @{
 */

/**
 * @}
 */

/** @addtogroup RCC_Exported_Functions
 * @{
 */

void RCC_DeInit(void);
void RCC_ConfigHse(uint32_t RCC_HSE);
ErrorStatus RCC_WaitHseStable(void);
void RCC_ConfigHsi(uint32_t RCC_HSI);
ErrorStatus RCC_WaitHsiStable(void);
void RCC_SetHsiCalibValue(uint8_t HSICalibrationValue);
void RCC_EnableHsi(FunctionalState Cmd);
void RCC_ConfigPll(uint32_t RCC_PLLSource, uint32_t RCC_PLLMul, uint32_t RCC_PLLPRE, uint32_t RCC_PLLOUTDIV);
void RCC_EnablePll(FunctionalState Cmd);
void RCC_EnablePllClockOut(FunctionalState Cmd);

void RCC_ConfigSysclk(uint32_t RCC_SYSCLKSource);
uint32_t RCC_GetSysclkSrc(void);
void RCC_ConfigHclk(uint32_t RCC_SYSCLK);
void RCC_ConfigPclk1(uint32_t RCC_HCLK);
void RCC_ConfigPclk2(uint32_t RCC_HCLK);
void RCC_ConfigInt(uint8_t RccInt, FunctionalState Cmd);

void RCC_ConfigTim18Clk(uint32_t RCC_TIM18CLKSource);
void RCC_ConfigRngcClk(uint32_t RCC_RNGCCLKPrescaler, uint32_t RNGCCLKCmd);

void RCC_ConfigAdc1mClk(uint32_t RCC_ADC1MCLKSource, uint32_t RCC_ADC1MPrescaler);
void RCC_ConfigAdcPllClk(uint32_t RCC_ADCPLLCLKPrescaler, FunctionalState Cmd);
void RCC_ConfigAdcHclk(uint32_t RCC_ADCHCLKPrescaler);

void RCC_ConfigLPRUNClk(uint32_t RCC_LPRUNCLKSource);
uint32_t RCC_GetLPRUNClkSrc(void);
void RCC_ConfigTSCClk(uint32_t RCC_TSCCLKSource);
uint32_t RCC_GetTSCClkSrc(void);

void RCC_ConfigLPTIMClk(uint32_t RCC_LPTIMCLKSource);
uint32_t RCC_GetLPTIMClkSrc(void);
void RCC_ConfigLPUARTClk(uint32_t RCC_LPUARTx, uint32_t RCC_LPUARTCLKSource);
uint32_t RCC_GetLPUARTClkSrc(uint32_t RCC_LPUARTx);

void RCC_ConfigLse(uint8_t RCC_LSE);
void RCC_EnableLsi(FunctionalState Cmd);
void RCC_ConfigRtcClk(uint32_t RCC_RTCCLKSource);
void RCC_EnableRtcClk(FunctionalState Cmd);
uint32_t RCC_GetRTCClkSrc(void);
void RCC_GetClocksFreqValue(RCC_ClocksType* RCC_Clocks);
void RCC_EnableAHBPeriphClk(uint32_t RCC_AHBPeriph, FunctionalState Cmd);
void RCC_EnableAPB2PeriphClk(uint32_t RCC_APB2Periph, FunctionalState Cmd);
void RCC_EnableAPB1PeriphClk(uint32_t RCC_APB1Periph, FunctionalState Cmd);

void RCC_EnableAHBPeriphReset(uint32_t RCC_AHBPeriph, FunctionalState Cmd);
void RCC_EnableAPB2PeriphReset(uint32_t RCC_APB2Periph, FunctionalState Cmd);
void RCC_EnableAPB1PeriphReset(uint32_t RCC_APB1Periph, FunctionalState Cmd);

void RCC_EnableClockSecuritySystem(FunctionalState Cmd);
void RCC_ConfigMcoClkPre(uint32_t RCC_MCOCLKPrescaler);
void RCC_ConfigMco(uint8_t RCC_MCO);
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG);
void RCC_ClrFlag(void);
INTStatus RCC_GetIntStatus(uint8_t RccInt);
void RCC_ClrIntPendingBit(uint32_t RccClrInt);

void RCC_EnableRAMCParityErrorReset(FunctionalState Cmd);

#ifdef __cplusplus
}
#endif

#endif /* __N32G032_RCC_H__ */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
